app/controllers/pizzas_controller.rb

  def index
    @pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"

  def show
    @pizza = Pizza.find_by(id: params[:id])
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pizza = Pizza.new(pizza_params)

    if @pizza.save
---
INSERT INTO "pizzas" ("name", "ingredients", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "steve"], ["ingredients", "nyeni,cow,goat"], ["created_at", "2023-03-19 17:53:04.683150"], ["updated_at", "2023-03-19 17:53:04.683150"]]

  def destroy
    @pizza = Pizza.find_by(id: params[:id])
    if @pizza
      @pizza.destroy
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 11]]