app/controllers/restaurants_controller.rb

  def index
    @restaurant = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
    @restaurants = Restaurant.find_by(id: params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hanna montana"], ["address", "57 kahuho road"], ["created_at", "2023-03-19 18:04:53.848404"], ["updated_at", "2023-03-19 18:04:53.848404"]]

  def destroy
    @restaurant = Restaurant.find_by(id: params[:id])
    if @restaurant.nil?
      render json: { error: 'Restaurant not found' }, status: :not_found
    else
      @restaurant.restaurant_pizzas.destroy_all
      @restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ?  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 11]]