app/controllers/restaurant_pizzas_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "restaurant_pizzas".* FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."restaurant_id" = ? AND "restaurant_pizzas"."pizza_id" = ? LIMIT ?  [["restaurant_id", 7], ["pizza_id", 2], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])
    if @restaurant
      @pizza = Pizza.find_by(id: params[:id])
      if @pizza
        @restaurant_pizza = RestaurantPizza.find_by(restaurant: @restaurant, pizza: @pizza)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "restaurant_pizzas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 5.0], ["restaurant_id", 1], ["pizza_id", 1], ["created_at", "2023-03-19 11:55:25.490712"], ["updated_at", "2023-03-19 11:55:25.490712"]]
---
  def create
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])
    @pizza = Pizza.find_by(id: params[:pizza_id])

    unless @restaurant && @pizza
      error = {}
      error[:restaurant] = "Restaurant not found" unless @restaurant
      error[:pizza] = "Pizza not found" unless @pizza
      render json: { errors: error }, status: :unprocessable_entity and return
    end

    @restaurant_pizza = RestaurantPizza.new(pizza_params)
    if @restaurant_pizza.save

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "restaurant_pizzas".* FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
DELETE FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ?  [["id", 101]]
---
  def destroy
    @restaurant_pizza = RestaurantPizza.find_by(id: params[:id])
    if @restaurant_pizza
      @restaurant_pizza.destroy